package Note;

public class Note211028 {
	/*인터페이스 측면에서 유지보수적으로 가느아니 매우 편리하게 진행 할 수 있다.
	 * 객체=클래스
	 * 클래스는 현실에 있어서 객체를 만들기 위한 설계도라고 생각하면 딤
	 * 자바는 이 객체를 생성하기 위해 클래스를 만듬 객체를 만들기 위해 필드와 메소드가  정의됨.
	 * 하나의 클래스로부터 여러개의 인스턴스를 만들 수 있음 -> 인스턴스화  ==>정확한 개념이 있으면 좋겠다
	 * 클래스 이름은 자바 식별자 작성 규칙에 근거하여 작성하고 이것은 한번식 확인해서 보는 방향으로 가면 좋을듯
	 * 이렇게 노트 쓰는것도 나쁘지 않내!
	 * 제목은 가급적 영어이름으로 작성!!
	 * 앵간하면 언더 없이 작성
	 * 
	 * 클래스 변수;
	 * 변수 = new 클래스(); or
	 * 클래스 변수 = new 클래스();
	 * 
	 * static 변수는 로딩이 될때 이미 메모리 영역에 로딩이 되어 있는 영역. 인스턴스가 객체를 ㅅ형성될때 마다 new를 붙여주는 것과 달리 이미 로딩하면서 존제하는 것이니 필요가 없다
	 */

}
